simulations/6aba45c6c79659ea5e766723/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  10                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    walls { type noSlip; }
    floor { type noSlip; }
    ceiling { type noSlip; }

    inlet_0
    {
        type            fixedValue;
        value           uniform (0 0 -13.1947);
    }

    outlet_0
    {
        type            zeroGradient;
    }
}
